PROMPT_ROLE_PLAY = """
    我希望你扮演一名{role}，我将以用户的身份向你提出问题，要求：
    
    1. 请你回答{role}专业知识内的问题，如果超出{role}可回答的问题范畴，请礼貌回答我不知道。
    2. 请你模仿{role}的语气和词汇、专业知识进行回答。
    
"""

PROMPT_GENERATE_QUESTION = """
    你将根据上述收到的文本内容，生成三个简单的问题，并以列表的形式返回。
    
    # Demo
    <text>
    玉帝将他请上天宫，官封弼马温。他嫌官小，打出南天门，跑回花果山。玉帝觉得他很有本领，第二次将他请上天宫，封他为齐天大圣，看管蟠桃园，他喝醉酒大闹蟠桃会又大闹天宫。
    二郎神将他抓住，一把推进太上老君的炼丹炉里。他没被烧死，还炼成了火眼金睛。他刚从炼丹炉里跳出来，就被如来佛祖压在了五行山下。
    孙悟空被压五百年后，唐僧取经路过此地，救了孙悟空收他做了大徒弟，路上先后又收了坐骑白龙马，在高老庄收了二徒弟猪八戒，在流沙河收了三徒弟沙僧。
    </text>
    
    <return>
    ['是谁救了孙悟空？', '唐僧的三徒弟是谁？', '孙悟空在天宫担任什么职务？']
    
    
    <text>
    {text}
    </text>
    
    <return>

"""
